package com.sh.shprojectdemo.ui;

import android.os.Bundle;
import android.text.TextUtils;

import com.jrfunclibrary.base.activity.BaseActivity;
import com.jruilibarary.widget.UISearchView;
import com.jruilibarary.widget.letterlist.LetterListView;
import com.jruilibarary.widget.letterlist.LetterModle;
import com.jruilibarary.widget.letterlist.LetterUtil;
import com.sh.shprojectdemo.R;
import com.sh.shprojectdemo.adapter.LetterAdapter;
import com.sh.shprojectdemo.model.City;

import java.util.ArrayList;
import java.util.List;

import butterknife.ButterKnife;
import butterknife.InjectView;

public class LetterListViewActivity extends BaseActivity implements UISearchView.SearchViewListener {

    @InjectView(R.id.listview)
    LetterListView listview;
    List<LetterModle> cities;
    @InjectView(R.id.search_view)
    UISearchView searchView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_letter_list_view);
        ButterKnife.inject(this);
        initView();

    }

    void initView(){
        searchView.setSearchViewListener(this);
        String[] cityArray = citys.split(",");
        //实体续继承 LetterModle
        cities = new ArrayList<>();
        for (String str : cityArray) {
            if (TextUtils.isEmpty(str)) {
                continue;
            }
            City city = new City(str);
            //设置 改对象的首字母
            LetterUtil.setFirstLetter(city, city.getName());
            cities.add(city);
        }
        /**
         * 按首字母排序list
         */
        LetterUtil.onSort(cities);

        LetterAdapter letterAdapter = new LetterAdapter(cities, this, new LetterAdapter.Selected() {
            @Override
            public void selectde(City city) {
                setResult(RESULT_OK, getIntent().putExtra("city", city.getName()));
                finish();
            }
        });
        listview.setAdapter(letterAdapter);
    }

    @Override
    public void searchViewCallText(String text) {
        showMessage("选择逻辑没有写~~~");
    }


    String citys = "上海市," +
            ",重庆市,合川市,永川市,江津市,南川市," +
            ",河北省," +
            ",石家庄市,辛集市,藁城市,晋州市,新乐市,鹿泉市," +
            ",张家口市," +
            ",承德市," +
            ",秦皇岛市," +
            ",唐山市,遵化市,迁安市," +
            ",廊坊市,霸州市,三河市," +
            ",保定市,定州市,涿州市,安国市,高碑店市," +
            ",衡水市,冀州市,深州市," +
            ",沧州市,泊头市,任丘市,黄骅市,河间市," +
            ",邢台市,南宫市,沙河市," +
            ",邯郸市,武安市," +
            ",山西省," +
            ",太原市,古交市," +
            ",朔州市," +
            ",大同市," +
            ",阳泉市," +
            ",长治市,潞城市," +
            ",晋城市,高平市," +
            ",忻州市,原平市," +
            ",晋中市,介休市," +
            ",临汾市,侯马市,霍州市," +
            ",吕梁市,孝义市,汾阳市," +
            ",运城市,永济市,河津市," +
            ",内蒙古自治区," +
            ",呼和浩特市," +
            ",包头市," +
            ",乌海市," +
            ",赤峰市," +
            ",通辽市,霍林郭勒市," +
            ",呼伦贝尔市,满洲里市,扎兰屯市,牙克石市,根河市,额尔古纳市," +
            ",鄂尔多斯市," +
            ",乌兰察布市,丰镇市," +
            ",巴彦淖尔市," +
            ",兴安盟,乌兰浩特市,阿尔山市,前面的括号表示低级非市行政区,下同," +
            ",锡林郭勒盟,锡林浩特市,二连浩特市," +
            ",辽宁省," +
            ",沈阳市,新民市," +
            ",朝阳市,北票市,凌源市" +
            ",阜新市," +
            ",铁岭市,调兵山市,开原市" +
            ",抚顺市," +
            ",本溪市," +
            ",辽阳市,灯塔市," +
            ",鞍山市,海城市," +
            ",丹东市,凤城市,东港市," +
            ",大连市,瓦房店市,普兰店市,庄河市," +
            ",营口市,大石桥市,盖州市," +
            ",盘锦市," +
            ",锦州市,凌海市,北宁市," +
            ",葫芦岛市,兴城市," +
            ",吉林省," +
            ",长春市,德惠市,九台市,榆树市," +
            ",白城市,大安市,洮南市," +
            ",松原市," +
            ",吉林市,磐石市,蛟河市,桦甸市,舒兰市," +
            ",四平市,双辽市,公主岭市," +
            ",辽源市," +
            ",通化市,梅河口市,集安市," +
            ",白山市,临江市," +
            ",延边朝鲜族自治州,延吉市,图们市,敦化市,珲春市,龙井市,和龙市," +
            ",黑龙江省," +
            ",哈尔滨市,双城市,尚志市,五常市,阿城市," +
            ",七台河市," +
            ",齐齐哈尔市,讷河市," +
            ",黑河市,北安市,五大连池市," +
            ",大庆市," +
            ",鹤岗市," +
            ",伊春市,铁力市," +
            ",佳木斯市,同江市,富锦市," +
            ",双鸭山市," +
            ",鸡西市,虎林市,密山市," +
            ",牡丹江市,穆棱市,绥芬河市,海林市,宁安市," +
            ",绥化市,安达市,肇东市,海伦市," +
            ",江苏省," +
            ",南京市," +
            ",徐州市,邳州市,新沂市," +
            ",连云港市," +
            ",宿迁市," +
            ",淮安市," +
            ",盐城市,东台市,大丰市," +
            ",扬州市,仪征市,江都市,高邮市," +
            ",泰州市,靖江市,泰兴市,姜堰市,兴化市," +
            ",南通市,海门市,启东市,通州市,如皋市" +
            ",镇江市,扬中市,丹阳市,句容市" +
            ",常州市,金坛市,溧阳市" +
            ",无锡市,江阴市,宜兴市" +
            ",苏州市,吴江市,昆山市,太仓市,常熟市张家港市" +
            ",浙江省" +
            ",杭州市,临安市,富阳市,建德市" +
            ",湖州市" +
            ",嘉兴市,平湖市,海宁市,桐乡市" +
            ",舟山市" +
            ",宁波市,慈溪市,余姚市,奉化市" +
            ",绍兴市,诸暨市,上虞市,嵊州市" +
            ",衢州市,江山市" +
            ",金华市,兰溪市,永康市,义乌市,东阳市" +
            ",台州市,临海市,温岭市" +
            ",温州市,瑞安市,乐清市" +
            ",丽水市,龙泉市" +
            ",安徽省" +
            ",合肥市" +
            ",宿州市" +
            ",淮北市" +
            ",亳州市" +
            ",阜阳市,界首市" +
            ",蚌埠市" +
            ",淮南市" +
            ",滁州市,明光市,天长市" +
            ",马鞍山市" +
            ",芜湖市" +
            ",铜陵市" +
            ",安庆市,桐城市" +
            ",黄山市" +
            ",六安市" +
            ",巢湖市" +
            ",池州市" +
            ",宣城市,宁国市" +
            ",福建省" +
            ",福州市,福清市,长乐市" +
            ",南平市,邵武市,武夷山市,建瓯市,建阳市" +
            ",莆田市" +
            ",三明市,永安市" +
            ",泉州市,石狮市,晋江市,南安市" +
            ",厦门市" +
            ",漳州市,龙海市" +
            ",龙岩市,漳平市" +
            ",宁德市,福安市,福鼎市" +
            ",江西省" +
            ",南昌市" +
            ",九江市,瑞昌市" +
            ",景德镇市,乐平市" +
            ",鹰潭市-贵溪市" +
            ",新余市" +
            ",萍乡市" +
            ",赣州市,瑞金市,南康市" +
            ",上饶市,德兴市" +
            ",抚州市" +
            ",宜春市,丰城市,樟树市,高安市" +
            ",吉安市" +
            ",山东省" +
            ",济南市,章丘市" +
            ",聊城市,临清市" +
            ",德州市,乐陵市,禹城市" +
            ",东营市" +
            ",淄博市" +
            ",潍坊市,安丘市,昌邑市,高密市,青州市,诸城市,寿光市" +
            ",烟台市,栖霞市,海阳市,龙口市,莱阳市,莱州市,蓬莱市,招远市" +
            ",威海市,荣成市,乳山市,文登市" +
            ",青岛市,胶州市,即墨市,平度市,胶南市,莱西市" +
            ",日照市" +
            ",临沂市" +
            ",枣庄市,滕州市" +
            ",济宁市,曲阜市,兖州市,邹城市" +
            ",泰安市,新泰市,肥城市" +
            ",莱芜市" +
            ",滨州市" +
            ",菏泽市" +
            ",河南省,济源市(省名后面的,的城市为省直辖县级市,下同," +
            ",郑州市,新郑市,登封市,新密市,巩义市,荥阳市" +
            ",三门峡市,义马市,灵宝市" +
            ",洛阳市,偃师市" +
            ",焦作市,孟州市,沁阳市" +
            ",新乡市,卫辉市,辉县市" +
            ",鹤壁市" +
            ",安阳市,林州市" +
            ",濮阳市" +
            ",开封市" +
            ",商丘市,永城市" +
            ",许昌市,禹州市,长葛市" +
            ",漯河市" +
            ",平顶山市,舞钢市,汝州市" +
            ",南阳市,邓州市" +
            ",信阳市" +
            ",周口市,项城市" +
            ",驻马店市" +
            ",湖北省,仙桃市,天门市,潜江市" +
            ",武汉市" +
            ",十堰市,丹江口市" +
            ",襄樊市,老河口市,枣阳市,宜城市" +
            ",荆门市,钟祥市" +
            ",孝感市,应城市,安陆市,汉川市" +
            ",黄冈市,麻城市,武穴市" +
            ",鄂州市" +
            ",黄石市,大冶市" +
            ",咸宁市,赤壁市" +
            ",荆州市,石首市,洪湖市,松滋市" +
            ",宜昌市,枝江市,宜都市,当阳市" +
            ",随州市,广水市" +
            ",恩施土家族苗族自治州,恩施市,利川市" +
            ",湖南省" +
            ",长沙市,浏阳市" +
            ",张家界市" +
            ",常德市,津市市" +
            ",益阳市,沅江市" +
            ",岳阳市,汨罗市,临湘市" +
            ",株洲市,醴陵市" +
            ",湘潭市,湘乡市,韶山市" +
            ",衡阳市,常宁市,耒阳市" +
            ",郴州市,资兴市" +
            ",永州市" +
            ",邵阳市,武冈市" +
            ",怀化市,洪江市" +
            ",娄底市,冷水江市,涟源市" +
            ",湘西土家族苗族自治州,吉首市" +
            ",广东省" +
            ",广州市,增城市,从化市" +
            ",清远市,英德市,连州市" +
            ",韶关市,乐昌市,南雄市" +
            ",河源市" +
            ",梅州市,兴宁市" +
            ",潮州市" +
            ",汕头市" +
            ",揭阳市,普宁市" +
            ",汕尾市,陆丰市" +
            ",惠州市" +
            ",东莞市" +
            ",深圳市" +
            ",珠海市" +
            ",中山市" +
            ",江门市,恩平市,台山市,开平市,鹤山市" +
            ",佛山市" +
            ",肇庆市,高要市,四会市" +
            ",云浮市,罗定市" +
            ",阳江市,阳春市" +
            ",茂名市,化州市,信宜市,高州市" +
            ",湛江市,吴川市,廉江市雷州市" +
            ",广西壮族自治区" +
            ",南宁市" +
            ",桂林市" +
            ",柳州市" +
            ",梧州市,岑溪市" +
            ",贵港市,桂平市" +
            ",玉林市,北流市" +
            ",钦州市" +
            ",北海市" +
            ",防城港市,东兴市" +
            ",崇左市,凭祥市" +
            ",百色市" +
            ",河池市,宜州市" +
            ",来宾市,合山市" +
            ",贺州市" +
            ",海南省,文昌市,琼海市,万宁市,五指山市,东方市,儋州市" +
            ",海口市" +
            ",三亚市" +
            ",四川省" +
            ",成都市,都江堰市,彭州市,邛崃市,崇州市" +
            ",广元市" +
            ",绵阳市,江油市" +
            ",德阳市,什邡市,广汉市,绵竹市" +
            ",南充市,阆中市" +
            ",广安市,华蓥市" +
            ",遂宁市" +
            ",内江市" +
            ",乐山市,峨眉山市" +
            ",自贡市" +
            ",泸州市" +
            ",宜宾市" +
            ",攀枝花市" +
            ",巴中市" +
            ",达州市,万源市" +
            ",资阳市,简阳市" +
            ",眉山市" +
            ",雅安市" +
            ",凉山彝族自治州,西昌市" +
            ",贵州省" +
            ",贵阳市,清镇市" +
            ",六盘水市" +
            ",遵义市,赤水市,仁怀市" +
            ",安顺市" +
            ",毕节地区,毕节市" +
            ",铜仁地区,铜仁市" +
            ",黔东南苗族侗族自治州,凯里市" +
            ",黔南布依族苗族自治州,都匀市,福泉市" +
            ",黔西南布依族苗族自治州,兴义市" +
            ",云南省" +
            ",昆明市,安宁市" +
            ",曲靖市,宣威市" +
            ",玉溪市" +
            ",保山市" +
            ",昭通市" +
            ",丽江市" +
            ",思茅市" +
            ",临沧市" +
            ",德宏傣族景颇族自治州,潞西市,瑞丽市" +
            ",大理白族自治州,大理市" +
            ",楚雄彝族自治州,楚雄市" +
            ",红河哈尼族彝族自治州,个旧市,开远市" +
            ",西双版纳傣族自治州,景洪市" +
            ",西藏自治区" +
            ",拉萨市" +
            ",日喀则地区,日喀则市" +
            ",陕西省" +
            ",西安市" +
            ",延安市" +
            ",铜川市" +
            ",渭南市,华阴市,韩城市" +
            ",咸阳市,兴平市" +
            ",宝鸡市" +
            ",汉中市" +
            ",榆林市" +
            ",安康市" +
            ",商洛市" +
            ",甘肃省" +
            ",兰州市" +
            ",嘉峪关市" +
            ",金昌市" +
            ",白银市" +
            ",天水市" +
            ",武威市" +
            ",酒泉市,玉门市,敦煌市" +
            ",张掖市" +
            ",庆阳市" +
            ",平凉市" +
            ",定西市" +
            ",陇南市" +
            ",临夏回族自治州,临夏市" +
            ",甘南藏族自治州,合作市" +
            ",青海省" +
            ",西宁市" +
            ",海西蒙古族藏族自治州,德令哈市格尔木市" +
            ",宁夏回族自治区" +
            ",银川市,灵武市" +
            ",石嘴山市" +
            ",吴忠市,青铜峡市" +
            ",固原市" +
            ",中卫市" +
            ",新疆维吾尔自治区,石河子市,阿拉尔市,图木舒克市,五家渠市" +
            ",乌鲁木齐市" +
            ",克拉玛依市" +
            ",喀什地区,喀什市" +
            ",阿克苏地区,阿克苏市" +
            ",和田地区,和田市" +
            ",吐鲁番地区,吐鲁番市" +
            ",哈密地区,哈密市" +
            ",克孜勒苏柯尔克孜自治州,阿图什市" +
            ",博尔塔拉蒙古自治州,博乐市" +
            ",昌吉回族自治州,昌吉市,阜康市,米泉市" +
            ",巴音郭楞蒙古自治州,库尔勒市" +
            ",伊犁哈萨克自治州,伊宁市,奎屯市" +
            ",塔城地区,塔城市,乌苏市" +
            ",阿勒泰地区,阿勒泰市";


}
